In [2]:
import pandas as pd

In [3]:
pass_in_trip_data = {
    'id': list(range(1, 33)),
    'trip': [1100, 1123, 1123, 1123, 1124, 1145, 1181, 1181, 1181, 1181, 1182, 1187, 1188, 1182, 1145, 1187, 8882, 7771, 7772, 8881, 7778, 7772, 7771, 7771, 7771, 7772, 7773, 7772, 8882, 7771, 7771, 7772],
    'passenger': [1, 3, 1, 6, 2, 3, 1, 6, 8, 5, 5, 8, 8, 9, 5, 10, 37, 37, 37, 37, 10, 10, 11, 11, 11, 12, 13, 13, 14, 14, 14, 14],
    'place': ['1a', '2a', '4c', '4b', '2d', '2c', '1a', '1b', '3c', '1c', '4b', '3a', '3a', '6d', '1d', '3d', '1a', '1c', '1a', '1d', '2a', '3a', '4a', '1b', '5a', '1d', '2d', '1b', '3d', '4d', '5d', '1c']
}
data_passenger = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 37, 38],
    'name': ['Bruce Willis', 'George Clooney', 'Kevin Costner', 'Donald Sutherland', 'Jennifer Lopez', 'Ray Liotta', 'Samuel L. Jackson', 'Nikole Kidman', 'Alan Rickman', 'Kurt Russell', 'Harrison Ford', 'Russell Crowe', 'Steve Martin', 'Michael Caine', 'Angelina Jolie', 'Mel Gibson', 'Michael Douglas', 'John Travolta', 'Sylvester Stallone', 'Tommy Lee Jones', 'Catherine Zeta-Jones', 'Antonio Banderas', 'Kim Basinger', 'Sam Neill', 'Gary Oldman', 'ClINT Eastwood', 'Brad Pitt', 'Johnny Depp', 'Pierce Brosnan', 'Sean Connery', 'Bruce Willis', 'Mullah Omar', 'Leonardo Grant-Baker']
}
data_company = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Don_avia', 'Aeroflot', 'Dale_avia', 'air_France', 'British_AW']
}
trip_data = {
    'id': [1100, 1101, 1123, 1124, 1145, 1146, 1181, 1182, 1187, 1188, 1195, 1196, 7771, 7772, 7773, 7774, 7775, 7776, 7777, 7778, 8881, 8882],
    'company': [4, 4, 3, 3, 2, 2, 1, 1, 1, 1, 1, 1, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5],
    'plane': ['Boeing', 'Boeing', 'TU-154', 'TU-154', 'IL-86', 'IL-86', 'TU-134', 'TU-134', 'TU-134', 'TU-134', 'TU-154', 'TU-154', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing'],
    'town_from': ['Rostov', 'Paris', 'Rostov', 'Vladivostok', 'Moscow', 'Rostov', 'Rostov', 'Moscow', 'Rostov', 'Moscow', 'Rostov', 'Moscow', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Paris'],
    'town_to': ['Paris', 'Rostov', 'Vladivostok', 'Rostov', 'Rostov', 'Moscow', 'Moscow', 'Rostov', 'Moscow', 'Rostov', 'Moscow', 'Rostov', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Paris', 'London'],
    'time_out': ['1900-01-01T14:30:00.000Z', '1900-01-01T08:12:00.000Z', '1900-01-01T16:20:00.000Z', '1900-01-01T09:00:00.000Z', '1900-01-01T09:35:00.000Z', '1900-01-01T17:55:00.000Z', '1900-01-01T06:12:00.000Z', '1900-01-01T12:35:00.000Z', '1900-01-01T15:42:00.000Z', '1900-01-01T22:50:00.000Z', '1900-01-01T23:30:00.000Z', '1900-01-01T04:00:00.000Z', '1900-01-01T01:00:00.000Z', '1900-01-01T12:00:00.000Z', '1900-01-01T03:00:00.000Z', '1900-01-01T14:00:00.000Z', '1900-01-01T09:00:00.000Z', '1900-01-01T18:00:00.000Z', '1900-01-01T18:00:00.000Z', '1900-01-01T22:00:00.000Z', '1900-01-01T03:00:00.000Z', '1900-01-01T22:00:00.000Z'],
    'time_in': ['1900-01-01T17:50:00.000Z', '1900-01-01T11:45:00.000Z', '1900-01-02T03:40:00.000Z', '1900-01-01T19:50:00.000Z', '1900-01-01T11:23:00.000Z', '1900-01-01T20:01:00.000Z', '1900-01-01T08:01:00.000Z', '1900-01-01T14:30:00.000Z', '1900-01-01T17:39:00.000Z', '1900-01-02T00:48:00.000Z', '1900-01-02T01:11:00.000Z', '1900-01-01T05:45:00.000Z', '1900-01-01T11:00:00.000Z', '1900-01-02T02:00:00.000Z', '1900-01-01T13:00:00.000Z', '1900-01-02T06:00:00.000Z', '1900-01-01T20:00:00.000Z', '1900-01-02T08:00:00.000Z', '1900-01-02T06:00:00.000Z', '1900-01-02T12:00:00.000Z', '1900-01-01T04:00:00.000Z', '1900-01-01T23:00:00.000Z']
}
Pass_in_trip = pd.DataFrame(pass_in_trip_data)
Passenger = pd.DataFrame(data_passenger)
Company = pd.DataFrame(data_company)
Trip = pd.DataFrame(trip_data)
Trip['time_out'] = pd.to_datetime(Trip['time_out'])
Trip['time_in'] = pd.to_datetime(Trip['time_in'])

In [4]:
learn_git = Trip.copy()

In [5]:
del_trip_from_Moscow = Trip.copy()[~(Trip['town_from']=='Moscow')]
del_trip_from_Moscow.head()

,id,company,plane,town_from,town_to,time_out,time_in
0,1100,4,Boeing,Rostov,Paris,1900-01-01 14:30:00+00:00,1900-01-01 17:50:00+00:00
1,1101,4,Boeing,Paris,Rostov,1900-01-01 08:12:00+00:00,1900-01-01 11:45:00+00:00
2,1123,3,TU-154,Rostov,Vladivostok,1900-01-01 16:20:00+00:00,1900-01-02 03:40:00+00:00
3,1124,3,TU-154,Vladivostok,Rostov,1900-01-01 09:00:00+00:00,1900-01-01 19:50:00+00:00
5,1146,2,IL-86,Rostov,Moscow,1900-01-01 17:55:00+00:00,1900-01-01 20:01:00+00:00

In [19]:
count_fligts = Trip.copy()['company'].value_counts()
count_fligts

id_companys_with_min_count = count_fligts[count_fligts==count_fligts.min()].index.to_list()

del_company_with_min_trips = Company.copy()[~Company['id'].isin(id_companys_with_min_count)]
del_company_with_min_trips

   id        name
0   1    Don_avia
4   5  British_AW

In [16]:
company_flights = Trip.copy()['company'].value_counts()
company_flights

company
5    10
1     6
4     2
2     2
3     2
Name: count, dtype: int64

In [37]:
count_pas_in_trip = Pass_in_trip.copy().groupby('trip')['trip'].count().reset_index(name='count')
count_pas_in_trip = count_pas_in_trip.sort_values(by='count', ascending=False).reset_index(drop=True)
count_pas_in_trip.head()

   trip  count
0  7771      6
1  7772      5
2  1181      4
3  1123      3
4  1182      2

In [15]:
names_pas_in_Moscow_on_tu_134 = Trip.merge(Pass_in_trip, left_on='id', right_on='trip').merge(Passenger, left_on='passenger', right_on='id')
names_pas_in_Moscow_on_tu_134 = names_pas_in_Moscow_on_tu_134[(names_pas_in_Moscow_on_tu_134['town_to']=='Moscow')&(names_pas_in_Moscow_on_tu_134['plane']=='TU-134')][['name']].drop_duplicates().reset_index(drop=True)
names_pas_in_Moscow_on_tu_134

             name
0    Bruce Willis
1      Ray Liotta
2   Nikole Kidman
3  Jennifer Lopez
4    Kurt Russell

In [ ]:
count_flights_from_Rostov_to_Moscow = Trip.copy()[(Trip['town_from']=='Rostov')&(Trip['town_to']=='Moscow')]['town_to'].count()
count_flights_from_Rostov_to_Moscow

np.int64(4)

In [ ]:
trip_from_Moscow = Trip[Trip['town_from']=='Moscow'][['id', 'town_from']].reset_index(drop=True)
trip_from_Moscow.index = trip_from_Moscow.index+1
trip_from_Moscow

     id town_from
1  1145    Moscow
2  1182    Moscow
3  1188    Moscow
4  1196    Moscow

In [ ]:
name_man = Passenger[Passenger['name'].str.contains('man', case=False)].reset_index(drop=True)
name_man.index = name_man.index+1
name_man

   id           name
1   8  Nikole Kidman
2   9   Alan Rickman
3  25    Gary Oldman

In [ ]:
plane_tu134 = Trip.groupby('plane').size()
plane_tu134.loc[['TU-134']]

plane
TU-134    4
dtype: int64

In [ ]:
company_on_boing = Trip.merge(Company, left_on='company', right_on='id',suffixes=['_trip', '_company'])
company_on_boing.head()

,id_trip,company,plane,town_from,town_to,time_out,time_in,id_company,name
0,1100,4,Boeing,Rostov,Paris,1900-01-01T14:30:00.000Z,1900-01-01T17:50:00.000Z,4,air_France
1,1101,4,Boeing,Paris,Rostov,1900-01-01T08:12:00.000Z,1900-01-01T11:45:00.000Z,4,air_France
2,1123,3,TU-154,Rostov,Vladivostok,1900-01-01T16:20:00.000Z,1900-01-02T03:40:00.000Z,3,Dale_avia
3,1124,3,TU-154,Vladivostok,Rostov,1900-01-01T09:00:00.000Z,1900-01-01T19:50:00.000Z,3,Dale_avia
4,1145,2,IL-86,Moscow,Rostov,1900-01-01T09:35:00.000Z,1900-01-01T11:23:00.000Z,2,Aeroflot

In [66]:
company_on_boing = company_on_boing[company_on_boing['plane'] == 'Boeing'][['name']]
company_on_boing.head()

          name
0   air_France
1   air_France
12  British_AW
13  British_AW
14  British_AW

In [74]:
company_on_boing.drop_duplicates().reset_index(drop=True)

         name
0  air_France
1  British_AW

In [81]:
companys_from_vladivostok = trip.merge(company, left_on='company', right_on='id')
companys_from_vladivostok = companys_from_vladivostok[companys_from_vladivostok['town_from'] == 'Vladivostok'][['name']].reset_index(drop=True)
companys_from_vladivostok.head()

        name
0  Dale_avia

In [ ]:
names_planes_to_moscow = Trip[Trip['town_to'] == 'Moscow'][['plane']].drop_duplicates().reset_index(drop=True)
names_planes_to_moscow

    plane
0   IL-86
1  TU-134
2  TU-154

In [19]:
cities_from_Paris_time = Trip[Trip['town_from'] == 'Paris'].copy()
cities_from_Paris_time['duration'] = cities_from_Paris_time['time_in']- cities_from_Paris_time['time_out']
cities_from_Paris_time = cities_from_Paris_time[['town_to', 'duration']]
cities_from_Paris_time

   town_to        duration
1   Rostov 0 days 03:33:00
21  London 0 days 01:00:00

In [23]:
flight_between_time = Trip.copy()
flight_between_time = flight_between_time[(flight_between_time['time_out']>='1900-01-01 10:00:00')&(flight_between_time['time_out']<='1900-01-01 14:00:00')]
flight_between_time

,id,company,plane,town_from,town_to,time_out,time_in
7,1182,1,TU-134,Moscow,Rostov,1900-01-01 12:35:00+00:00,1900-01-01 14:30:00+00:00
13,7772,5,Boeing,Singapore,London,1900-01-01 12:00:00+00:00,1900-01-02 02:00:00+00:00
15,7774,5,Boeing,Singapore,London,1900-01-01 14:00:00+00:00,1900-01-02 06:00:00+00:00

In [29]:
length_name = Passenger.copy()
max_length = length_name['name'].str.len().max()
max_length_name = length_name[length_name['name'].str.len() == max_length]
max_length_name

    id                  name
20  21  Catherine Zeta-Jones
32  38  Leonardo Grant-Baker

In [23]:
count_pass = Trip.merge(Pass_in_trip, how='left', left_on='id', right_on='trip')
count_pass.head()

,id_x,company,plane,town_from,town_to,time_out,time_in,id_y,trip,passenger,place
0,1100,4,Boeing,Rostov,Paris,1900-01-01 14:30:00+00:00,1900-01-01 17:50:00+00:00,1.0,1100.0,1.0,1a
1,1101,4,Boeing,Paris,Rostov,1900-01-01 08:12:00+00:00,1900-01-01 11:45:00+00:00,NaN,NaN,NaN,NaN
2,1123,3,TU-154,Rostov,Vladivostok,1900-01-01 16:20:00+00:00,1900-01-02 03:40:00+00:00,2.0,1123.0,3.0,2a
3,1123,3,TU-154,Rostov,Vladivostok,1900-01-01 16:20:00+00:00,1900-01-02 03:40:00+00:00,3.0,1123.0,1.0,4c
4,1123,3,TU-154,Rostov,Vladivostok,1900-01-01 16:20:00+00:00,1900-01-02 03:40:00+00:00,4.0,1123.0,6.0,4b

In [27]:
res = count_pass.groupby('id_x')['passenger'].count().reset_index()
res.sort_values(by='passenger', ascending=False).head()

    id_x  passenger
12  7771          6
13  7772          5
6   1181          4
2   1123          3
7   1182          2

In [30]:
pass_twice = Passenger.copy()
pass_twice = pass_twice['name'].value_counts().reset_index(name='count_names')
pass_twice = pass_twice[pass_twice['count_names']>1]
pass_twice

           name  count_names
0  Bruce Willis            2

In [33]:
bruce_to_town = Passenger.merge(Pass_in_trip, left_on='id', right_on='passenger').merge(Trip, left_on='trip', right_on='id')
bruce_to_town = bruce_to_town[bruce_to_town['name']=='Bruce Willis'][['town_to']]
bruce_to_town

       town_to
0        Paris
1  Vladivostok
2       Moscow

In [38]:
Steve_Martin_id_and_time_in = Passenger.merge(Pass_in_trip, left_on='id', right_on='passenger').merge(Trip, left_on='trip', right_on='id')
Steve_Martin_id_and_time_in = Steve_Martin_id_and_time_in[(Steve_Martin_id_and_time_in['name'] == 'Steve Martin')&(Steve_Martin_id_and_time_in['town_to'] == 'London')][['id_x', 'time_in']]
Steve_Martin_id_and_time_in = Steve_Martin_id_and_time_in.rename(columns={'id_x':'id'})
Steve_Martin_id_and_time_in

    id                   time_in
23  13 1900-01-02 02:00:00+00:00

In [52]:
trip_more_one = Passenger.merge(Pass_in_trip, left_on='id', right_on='passenger')
trip_more_one = trip_more_one.groupby('name')['trip'].count()
trip_more_one = pd.DataFrame(trip_more_one)
trip_more_one.sort_values(by=['trip', 'name'], ascending=[False, True])

                trip
name
Michael Caine      4
Mullah Omar        4
Bruce Willis       3
Harrison Ford      3
Jennifer Lopez     3
Kurt Russell       3
Nikole Kidman      3
Kevin Costner      2
Ray Liotta         2
Steve Martin       2
Alan Rickman       1
George Clooney     1
Russell Crowe      1